bouyantBoussinesqSimple/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00735;

boundaryField
{ 
    inlet
    {
        type            fixedValue;
        value            $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontandBack
    {
        type            empty;
    }
    wall
    {
         type            kqRWallFunction;
        value           $internalField;
    }
    hot
    {
        type            kqRWallFunction;
        value            $internalField;
    }
    
}


// ************************************************************************* //
