bouyantBoussinesqSimple/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type            fixedFluxPressure;
        value           $internalField;
    }
    outlet
    {
          type            fixedValue;
        value           $internalField;
    }
    frontandBack
    {
        type            empty;
    }
    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    hot
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
